# Sample Snippet: Demo02

Source project: `existingCodes\梁涛插件源代码\10.CEG\Demo02\Demo02`

This is a compact reference excerpt generated from existing plug-ins. It preserves the command structure and key API usage without requiring the full `existingCodes/` tree during normal skill use.

## Command.cs

```csharp
using Autodesk.Revit.Attributes;
using Autodesk.Revit.DB;
using Autodesk.Revit.UI;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Shapes;
using Line = Autodesk.Revit.DB.Line;

//板块标注或者基础埋件标注
namespace Demo02
{
    [Transaction(TransactionMode.Manual)]
    public class Command : IExternalCommand
    {
        public Result Execute(ExternalCommandData commandData, ref string message, ElementSet elements)
        {
            UIDocument uIDoc = commandData.Application.ActiveUIDocument;
            Document doc = uIDoc.Document;

            IList<Reference> references = uIDoc.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType.Element, "Frame selection of embedded parts");
            Reference reference2 = uIDoc.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType.Element, "Select the embedded parts to be marked");
            List<Reference> references1 = new List<Reference>();
            foreach (Reference item in references)
            {
                FamilyInstance familyInstance = doc.GetElement(item) as FamilyInstance;
                FamilyInstance familyInstance2 = doc.GetElement(reference2) as FamilyInstance;
                if (familyInstance != null && familyInstance.Name.Equals(familyInstance2.Name))
                {
                    references1.Add(item);
                }
                if (doc.GetElement(item) is Grid)
                {
                    references1.Add(item);
                }
            }
            // 在立面视图上创建与当前视图平行的工作平面
            using (Transaction transaction = new Transaction(doc, "Create Sketch Plane"))
            {
                transaction.Start();

                // 获取当前视图的方向
                XYZ viewDirection = uIDoc.ActiveView.ViewDirection;

                // 创建平面的位置（这里假设在Z轴方向上移动10个单位）
                XYZ planeLocation = new XYZ(0, 0, 10);

                // 创建平面
                Plane plane = Plane.CreateByNormalAndOrigin(viewDirection, planeLocation);

                // 在文档中创建平面
                SketchPlane sketchPlane = SketchPlane.Create(doc, plane);

                // 将新创建的平面设置为当前视图的工作平面
                uIDoc.ActiveView.SketchPlane = sketchPlane;

                transaction.Commit();
            }

            XYZ point = uIDoc.Selection.PickPoint("Select the location to place the annotation");
            ReferenceArray referenceArray = new ReferenceArray();
            XYZ p1 = null;
            XYZ p2 = null;
            int count = 0;
            foreach (Reference reference in references1)
            {
                if (doc.GetElement(reference) is FamilyInstance)
                {
                    count++;
                    FamilyInstance familyInstance = doc.GetElement(reference) as FamilyInstance;
                    if (p1 == null && count == 1)
                    {
                        p1 = (familyInstance.Location as LocationPoint).Point;
                    }
                    if (p2 == null && count == 2)
                    {
                        p2 = (familyInstance.Location as LocationPoint).Point;
                    }
                }
                if (count > 2 )
                {
                    break;
                }
            }
            foreach (Reference reference in references1)
            {
                Reference reference1 = null;
// ... truncated ...
```

## Command02.cs

```csharp
using Autodesk.Revit.Attributes;
using Autodesk.Revit.DB;
using Autodesk.Revit.UI;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Controls;

//tag所有选定的板块
namespace Demo02
{
    [Transaction(TransactionMode.Manual)]
    internal class Command02 : IExternalCommand
    {
        public Result Execute(ExternalCommandData commandData, ref string message, ElementSet elements)
        {
            UIDocument uIDoc = commandData.Application.ActiveUIDocument;
            Document doc = uIDoc.Document;
            List<FamilyInstance> elements1 = new FilteredElementCollector(doc,uIDoc.ActiveView.Id).OfCategory(BuiltInCategory.OST_StructuralFraming).OfClass(typeof(FamilyInstance)).Cast<FamilyInstance>().ToList();
            ViewPlan viewPlan = new FilteredElementCollector(doc).OfCategory(BuiltInCategory.OST_Views).OfClass(typeof(ViewPlan)).Cast<ViewPlan>().ToList().FirstOrDefault();
            HashSet<string> familyNames = new HashSet<string>();

            UserControl02 userControl02 = new UserControl02();
            foreach (FamilyInstance item in elements1)
            {
                if (!familyNames.Contains(item.Symbol.FamilyName))
                {
                    familyNames.Add(item.Symbol.FamilyName);
                    userControl02.comboBox.Items.Add(item.Symbol.FamilyName);
                }
            }

            userControl02.ShowDialog();
            if (userControl02.cancel)
            {
                return Result.Cancelled;
            }
            //XYZ point = uIDoc.Selection.PickPoint();
            //TaskDialog.Show("tips", userControl02.value);
            // 在立面视图上创建与当前视图平行的工作平面
            using (Transaction transaction = new Transaction(doc, "Create Sketch Plane"))
            {
                transaction.Start();

                // 获取当前视图的方向
                XYZ viewDirection = uIDoc.ActiveView.ViewDirection;

                // 创建平面的位置（这里假设在Z轴方向上移动10个单位）
                XYZ planeLocation = new XYZ(0, 0, 10);

                // 创建平面
                Plane plane = Plane.CreateByNormalAndOrigin(viewDirection, planeLocation);

                // 在文档中创建平面
                SketchPlane sketchPlane = SketchPlane.Create(doc, plane);

                // 将新创建的平面设置为当前视图的工作平面
                uIDoc.ActiveView.SketchPlane = sketchPlane;

                transaction.Commit();
            }

            XYZ point = uIDoc.Selection.PickPoint();

            using (Transaction t = new Transaction(doc, "Create Tags"))
            {
                t.Start();
                foreach (FamilyInstance element in elements1)
                {
                    if (element.Symbol.FamilyName.Equals(userControl02.value))
                    {
                        Reference reference = new Reference(element);
                        XYZ p = (element.Location as LocationPoint).Point;
                        p = new XYZ(p.X, p.Y, point.Z);
                        IndependentTag independentTag = IndependentTag.Create(doc, uIDoc.ActiveView.Id, reference, false, TagMode.TM_ADDBY_CATEGORY, TagOrientation.Horizontal, p);
                    }
                }
                t.Commit();
            }
            return Result.Succeeded;
        }
    }
}

```

## Command03.cs

```csharp
using Autodesk.Revit.Attributes;
using Autodesk.Revit.DB;
using Autodesk.Revit.UI;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//tag所有埋件
namespace Demo02
{
    [Transaction(TransactionMode.Manual)]
    internal class Command03 : IExternalCommand
    {
        public Result Execute(ExternalCommandData commandData, ref string message, ElementSet elements)
        {
            UIDocument uIDoc = commandData.Application.ActiveUIDocument;
            Document doc = uIDoc.Document;

            List<FamilyInstance> familyInstances = new FilteredElementCollector(doc,uIDoc.ActiveView.Id).OfCategory(BuiltInCategory.OST_SpecialityEquipment).OfClass(typeof(FamilyInstance)).Cast<FamilyInstance>().ToList();
            //double count = 0;
            using (Transaction t = new Transaction(doc, "Create Dedicated Device Annotations"))
            {
                t.Start();
                foreach (FamilyInstance familyInstance in familyInstances)
                {
                    //if (!("L3 P2 P100 - MiniV_Angle".Contains(familyInstance.Name)))
                    //{
                    //    continue;
                    //}
                    XYZ p1 = null;
                    XYZ p2 = null;
                    if (familyInstance.Name.Equals("L3"))
                    {
                        p1 = new XYZ(0.6, 1, 0);
                        p2 = new XYZ(2.1, 1, 0);
                    }
                    else if (familyInstance.Name.Equals("P2"))
                    {
                        p1 = new XYZ(1, -1, 0);
                        p2 = new XYZ(3, -1, 0);
                    }
// ... truncated ...
```